{
  "id": "password",
  "moduleId": "autentication",
  "title": "Recuperación de la Contraseña",

  "intro": "La opción Recuperar contraseña permite restablecer el acceso al sistema en caso de haber olvidado la contraseña personal. Al seleccionar esta opción, el usuario será dirigido a un formulario donde podrá ingresar su correo electrónico registrado para iniciar el procedimiento y definir una nueva contraseña.",

  "sections": [
    {
      "id": "roles-note",
      "blocks": [
        {
          "type": "note",
          "variant": "info",
          "text": "<strong>Roles autorizados a interactuar:</strong> <br> Usuarios internos del laboratorio"
        },
        {
          "type": "divider"
        }
      ]
    },
    {

      "id": "solicitar-enlace",
      "title": "Solicitar el enlace de recuperación",
      "blocks": [
        {
          "type": "paragraph",
          "text": "La opción Recuperar Contraseña se encuentra en la pantalla de Inicio de Sesión. Al seleccionarla, el sistema redirige a un formulario donde debe ingresar su correo electrónico registrado."
        },
        {
          "type": "image",
          "src": "assets/manual/access/password/password.jpg",
          "alt": "Pantalla de recuperación de contraseña"
        },
        {
          "type": "subtitle",
          "text": "Ingreso de credencial"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "<strong>1. </strong>En la pantalla Recuperar Contraseña, ingrese su correo electrónico registrado.",
            "<strong>2. </strong> Luego, seleccione <strong>Enviar enlace de recuperación</strong>.",
            "<strong>3. </strong>El sistema mostrará un mensaje confirmando el envío del correo con las instrucciones."
          ]

        },
        {
          "type": "image",
          "src": "assets/manual/access/password/message-restore-password.jpg",
          "alt": "Correo recibido para restablecer contraseña"
        },
        {
          "type": "subtitle",
          "text": "Acciones disponibles en la pantalla Recuperar Contraseña"
        },
        {
          "type": "table",
          "columns": [
            "Campo/Botón",
            "Ícono",
            "Descripción"
          ],
          "rows": [
            [
              "Enviar enlace de recuperación",
              "<i class='pi pi-envelope'></i>",
              "Botón que envía un correo con el enlace de restablecimiento de contraseña al email ingresado."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "success",
          "title": "✓ Nota importante",
          "text": "<br>● Verifique que el correo electrónico esté correctamente escrito antes de enviarlo.<br>● Si no ingresa un correo electrónico válido, el sistema le mostrará un mensaje de error.<br>● Espere unos segundos antes de volver a presionar el botón si no visualiza la confirmación.<br>● Evite presionar repetidamente el botón para no generar solicitudes duplicadas.<br>● Si ha perdido el acceso a su correo electrónico registrado, comuníquese con el administrador para resolver el inconveniente."
        },
        {
          "type": "divider"
        }
      ]
    },

    {
      "id": "revisar-correo",
      "title": "Revisar el correo y abrir el mensaje enviado",
      "blocks": [
        {
          "type": "list",
          "ordered": true,
          "items": [
            "<strong>1. </strong>En la bandeja de entrada de su correo electrónico, debe aparecer un mensaje con el asunto “Recuperar contraseña” enviado por el Sistema de Gestión del Laboratorio Castillo Chidiak."
          ]
        },
        {
          "type": "image",
          "src": "assets/manual/access/password/message-mail-password.png",
          "alt": "Correo recibido para restablecer contraseña"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "<strong>2. </strong>Dentro del correo, seleccione el botón <strong>Restablecer contraseña</strong>.",
            "<strong>3. </strong>Luego, será redirigido a la pantalla Restablecer Contraseña del sistema."
          ]
        },
        {
          "type": "note",
          "variant": "success",
          "title": "✓ Nota importante",
          "text": "<br>● El enlace tiene una validez de 30 minutos por razones de seguridad.<br>● Si el enlace expiró o ya fue utilizado, será necesario solicitar uno nuevo repitiendo los pasos anteriores.<br>● Si usted no solicitó la recuperación de la contraseña, ignore el mensaje: su contraseña actual permanecerá sin cambios."
        },
        {
          "type": "subtitle",
          "text": "¿No recibió el correo de recuperación?"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "● Revise carpetas como Spam, No deseados, Promociones u otras pestañas de su correo.",
            "● Utilice el buscador interno del correo e ingrese “Recuperar contraseña” o el nombre del remitente.",
            "● Verifique que el correo ingresado esté correctamente escrito. Si es necesario, repita el procedimiento.",
            "● Confirme que tiene conexión a internet y que su casilla no está llena."
          ]
        },
        {
          "type": "paragraph",
          "text": "Si luego de estas verificaciones, el mensaje aún no llega, comuníquese con el administrador del sistema para obtener asistencia y validar el estado de su cuenta."
        },
        {
          "type": "divider"
        }
      ]
    },

    {
      "id": "nueva-contraseña",
      "title": "Definir una nueva contraseña",
      "blocks": [
        {
          "type": "image",
          "src": "assets/manual/access/password/restorage-new-password.png",
          "alt": "Pantalla de restablecer contraseña"
        },
        {
          "type": "subtitle",
          "text": "Ingreso de credenciales"
        },
        {
          "type": "list",
          "ordered": true,
          "items": [
            "<strong>1. </strong>Ingrese su nueva contraseña en el campo <strong>Nueva contraseña</strong>. Debe tener al menos 8 caracteres y combinar mayúsculas, minúsculas, números y símbolos.",
            "<strong>2. </strong>Vuelva a ingresarla en el campo <strong>Confirmar contraseña</strong>.",
            "<strong>3. </strong>Seleccione el botón <strong>Iniciar Sesión</strong> para guardar la nueva contraseña y acceder al sistema."
          ]
        },
        {
          "type": "subtitle",
          "text": "Acciones disponibles en la pantalla Restablecer Contraseña"
        },
        {
          "type": "table",
          "columns": [
            "Botón",
            "Ícono",
            "Descripción"
          ],
          "rows": [
            [
              "Iniciar Sesión",
              "<i class='pi pi-lock'></i>",
              "Guarda la nueva contraseña, valida que ambos campos coincidan y permite ingresar al sistema."
            ]
          ]
        },
        {
          "type": "note",
          "variant": "success",
          "title": "✓ Nota importante",
          "text": "<br>Si el sistema muestra mensajes como “las contraseñas no coinciden” o “formato no válido”, verifique que:<br>● Ambas contraseñas sean idénticas.<br>● Cumplan con los requisitos mínimos solicitados.\nRealice las correcciones necesarias y vuelva a intentar."
        },
        {
          "type": "divider"
        },
        {
          "type": "subtitle",
          "text": "Seguridad y buenas prácticas"
        },
        {
          "type": "list",
          "ordered": false,
          "items": [
            "● Evite usar datos obvios como nombre, apellido, fecha de nacimiento o secuencias simples.",
            "● No reutilice contraseñas de otros sitios o sistemas.",
            "● No comparta el enlace de recuperación ni su nueva contraseña.",
            "● Si usa un equipo compartido, cierre sesión y el navegador al finalizar.",
            "● Si sospecha acceso no autorizado:\n- Cambie la contraseña lo antes posible.\n- Informe al equipo de soporte para revisar actividad inusual."
          ]
        }
      ]
    }
  ],

  "tags": [
    "recuperación",
    "contraseña",
    "seguridad",
    "manual"
  ]
}
